src/DataProcessors/ЗаливкаЗП/ЗаливкаЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаливкаЗП</name>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/ПлановыеНачисленияРаботниковОрганизаций/ПлановыеНачисленияРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеНачисленияРаботниковОрганизаций</name>
  <comment>(Регл) Начало действия начисления начало дня, окончание начисления - конец дня</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Действие</name>
    <type>
      <types>EnumRef.ВидыДействияСНачислением</types>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Показатель1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта1</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Показатель2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта2</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Показатель5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд2</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта3</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд3</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Валюта5</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта6</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд1</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта4</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд4</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд5</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд6</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ВидУчетаВремениДляСредней</name>
    <type>
      <types>EnumRef.ВидыУчетаВремениДляСредней</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчетаИзмерение</name>
    <type>
      <types>ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОплатаПоСреднемуЗаработку</types>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СотрудникиОрганизаций/СотрудникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СотрудникиОрганизаций</name>
  <basedOn>Catalog.ФизическиеЛица</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровСФизЛицами</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятостиВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспытательныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаТарифнойСтавки</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостфиксНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифныйРазряд</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеНазначение</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВзносов</name>
    <type>
      <types>CatalogRef.ГруппыВзносовВФонды</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяДолжностьОрганизации</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееПодразделениеКомпании</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяДолжностьКомпании</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботуВКомпанию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольненияИзКомпании</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПерсональныеНадбавки</name>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта1</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта2</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта3</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта4</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд1</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд2</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд3</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд4</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта5</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта6</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд5</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд6</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ЗаливкаЗП/ObjectModule.bsl
Процедура ПровестиДоки(ИмяФайла) Экспорт
    
    ТД = Новый ТабличныйДокумент;   
    ТД.Прочитать(ИмяФайла);
    
    ТаблицаРезультат = Новый ТаблицаЗначений;
    ТаблицаРезультат.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.СотрудникиОрганизаций")); 
    ТаблицаРезультат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
    ТаблицаРезультат.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
    
    КолвоСтрокФайла = ТД.ВысотаТаблицы;
    КолВоКолонокФайла = ТД.ШиринаТаблицы;
    
    //НачСтрока = ?(НачСтрока = 0, 2, НачСтрока);
	КонСтрока = КолвоСтрокФайла;
	
	Для нСтрокаТФ = 2 ПО КонСтрока Цикл
		НоваяСтрокаТФ = ТаблицаРезультат.Добавить();
		
        КодСотрудника = ТД.ПолучитьОбласть("R"+нСтрокаТФ+"C1").ТекущаяОбласть.Текст;
        КодСотрудника = СокрЛП(КодСотрудника);
        НоваяСтрокаТФ.Сотрудник = Справочники.СотрудникиОрганизаций.НайтиПоКоду(КодСотрудника);
        Если НЕ ЗначениеЗаполнено(НоваяСтрокаТФ.Сотрудник) Тогда
            ТаблицаРезультат.Удалить(НоваяСтрокаТФ);
            Сообщить("Сотрудник в строке " + нСтрокаТФ + " не определен. Будет пропущен");	
            Продолжить;
        КонецЕсли; 
        
        КодПодразделения = ТД.ПолучитьОбласть("R"+нСтрокаТФ+"C4").ТекущаяОбласть.Текст;
        КодПодразделения = СокрЛП(КодПодразделения);
        НоваяСтрокаТФ.Подразделение = Справочники.ПодразделенияОрганизаций.НайтиПоКоду(КодПодразделения);
        Если НЕ ЗначениеЗаполнено(НоваяСтрокаТФ.Подразделение) Тогда
            Сообщить("Подразделение в строке " + нСтрокаТФ + " не определено. Будет взято подразделение сотрудника");	
            НоваяСтрокаТФ.Подразделение = НоваяСтрокаТФ.Сотрудник.ПодразделениеОрганизации;
        КонецЕсли; 
        
        Попытка
            Сумма = ТД.ПолучитьОбласть("R"+нСтрокаТФ+"C5").ТекущаяОбласть.Текст;
            НоваяСтрокаТФ.Сумма = Окр(Число(Сумма),2);
        Исключение
            Сообщить("Сумма в строке " + КонСтрока + " не определена");
            НоваяСтрокаТФ.Сумма = 0;
        КонецПопытки; 
              
    КонецЦикла;
    НЗ=Неопределено;
    сПодразделение = Неопределено;
    ТаблицаРезультат.Сортировать("Подразделение,Сотрудник"); 
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение,
                   |    ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
                   |    ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период,
                   |    РаботникиОрганизацийСрезПоследних.ГрафикРаботы
                   |ИЗ
                   |    РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Дата, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Сотрудник В (&Сотрудник)) КАК РаботникиОрганизацийСрезПоследних
                   |        ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
                   |ГДЕ
                   |    ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник В(&Сотрудник)
                   |    И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Актуальность = ИСТИНА";
    Запрос.УстановитьПараметр("Сотрудник",ТаблицаРезультат.ВыгрузитьКолонку("Сотрудник"));
    Запрос.УстановитьПараметр("Дата",ТекущаяДата());
    ТаблицаВидовНачислений = Запрос.Выполнить().Выгрузить();
    ТаблицаВидовНачислений.Сортировать("Период Возр");
    Если ЗначениеЗаполнено(Подразделение) Тогда
        НЗ = Документы.НачислениеЗарплатыРаботникамОрганизаций.СоздатьДокумент();
        НЗ.ПериодРегистрации = ПериодРегистрации;    	
        НЗ.ПодразделениеОрганизации = Подразделение;
        НЗ.Организация = Организация;
        НЗ.Дата = ТекущаяДата();	
    КонецЕсли; 
    Для каждого Строка Из ТаблицаРезультат Цикл       
        Если сПодразделение <> Строка.Подразделение И  НЕ ЗначениеЗаполнено(Подразделение) Тогда
            Если НЗ <> Неопределено Тогда
                УстановитьПривилегированныйРежим(Истина);
                НЗ.Записать(РежимЗаписиДокумента.Запись);	
                Сообщить("Создан " + НЗ.ССылка);
                УстановитьПривилегированныйРежим(Ложь);
            КонецЕсли; 
            НЗ = Документы.НачислениеЗарплатыРаботникамОрганизаций.СоздатьДокумент();
            НЗ.ПериодРегистрации = ПериодРегистрации;    	
            НЗ.ПодразделениеОрганизации = Строка.Подразделение;
            НЗ.Дата = ТекущаяДата();
        КонецЕсли; 
    	НоваяСтрока = НЗ.РаботникиОрганизации.Добавить();
        НоваяСтрока.Сотрудник = Строка.Сотрудник;
        НоваяСтрока.ФизЛицо = Строка.Сотрудник.Физлицо;
        НоваяСтрока = НЗ.Начисления.Добавить();
        НоваяСтрока.Сотрудник = Строка.Сотрудник;
        НоваяСтрока.Назначение = Строка.Сотрудник;
        НоваяСтрока.БазовыйПериодНачало = ПериодРегистрации;
        НоваяСтрока.БазовыйПериодКонец = КонецМесяца(ПериодРегистрации);
        Если ЗначениеЗаполнено(Строка.Сотрудник.ВидРасчета) Тогда
            НоваяСтрока.ВидРасчета = Строка.Сотрудник.ВидРасчета;
        Иначе
            НайденнаяСтрока =  ТаблицаВидовНачислений.Найти(Строка.Сотрудник,"Сотрудник");
            Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
                НоваяСтрока.ВидРасчета = НайденнаяСтрока.ВидРасчетаИзмерение;	
            КонецЕсли; 
        КонецЕсли; 
        Если ЗначениеЗаполнено(Строка.Сотрудник.ГрафикРаботы) Тогда
            НоваяСтрока.ГрафикРаботы = Строка.Сотрудник.ГрафикРаботы;
        Иначе
            НайденнаяСтрока =  ТаблицаВидовНачислений.Найти(Строка.Сотрудник,"Сотрудник");
            Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
                НоваяСтрока.ГрафикРаботы = НайденнаяСтрока.ГрафикРаботы;
            КонецЕсли;
        КонецЕсли;            
        НоваяСтрока.ДатаНачала = ПериодРегистрации;
        НоваяСтрока.ДатаОкончания = КонецМесяца(ПериодРегистрации);
        НоваяСтрока.ПодразделениеОрганизации = Строка.Подразделение;
        //НоваяСтрока.Показатель1  = Строка.Сумма;
        НоваяСтрока.Результат  = Строка.Сумма;
        сПодразделение = Строка.Подразделение;
    КонецЦикла; 
    Если ЗначениеЗаполнено(Подразделение) И НЗ <> Неопределено Тогда
        НЗ.Записать(РежимЗаписиДокумента.Запись);	
        Сообщить("Создан " + НЗ.ССылка);  
    КонецЕсли;

КонецПроцедуры
